# MySQL 8.0 Reference Manual

## Basic Steps for MySQL Server Deployment with Docker

### Starting a MySQL Server Instance

MySQL docker official image

In [1]:
!docker run --name=mysql1 -p 3306:3306 -e MYSQL_ROOT_PASSWORD=mysqlpass -d mysql

57c02da18df1ceccf806d53a25acbc1f805aca3df9b9fbb52b103903628f599b

MySQL docker Oracle image
```
docker run --name=mysql1 -p 3306:3306 -e MYSQL_ROOT_PASSWORD=mysqlpass -d mysql/mysql-server
```

### Connecting to MySQL Server from within the Container

```
docker exec -it mysql1 mysql -uroot -p
```

### Container Shell Access

```
docker exec -it mysql1 bash 
```

### Stopping and Deleting a MySQL Container

```
docker stop mysql1
```

```
docker restart mysql1
```

```
docker rm mysql1
```

## Tutorial

### Connecting to and Disconnecting from the Server

```
mysql -u root -p
```

In [2]:
from sqlalchemy import create_engine, inspect, Table, Column, MetaData, CHAR, VARCHAR, DATE, select, desc, func, text
from sqlalchemy.sql import and_, or_, not_, alias

In [3]:
engine = create_engine('mysql+pymysql://root:mysqlpass@localhost', pool_recycle=3600)
conn = engine.connect()

In [4]:
def query(s):
    result = conn.execute(s)
    for row in result:
        print(row)

### Creating and Selecting a Database

```sql
SHOW DATABASES;
```

In [5]:
def get_dbs():
    insp = inspect(engine)
    dbs = insp.get_schema_names()
    print(dbs)
    
get_dbs()

['information_schema', 'mysql', 'performance_schema', 'sys']

```sql
CREATE DATABASE menagerie;
```

In [6]:
def set_queries(queries):
    for query in queries:
        result = conn.execute(query)
      
queries = [
    'DROP DATABASE IF EXISTS menagerie;',
    'CREATE DATABASE menagerie;'           
]

set_queries(queries)

get_dbs()

['information_schema', 'menagerie', 'mysql', 'performance_schema', 'sys']

/home/eduardo/py37/lib/python3.7/site-packages/pymysql/cursors.py:170: Warning: (1008, "Can't drop database 'menagerie'; database doesn't exist")
  result = self._query(query)

In [7]:
conn.close()

In [8]:
engine = create_engine('mysql+pymysql://root:mysqlpass@localhost/menagerie', pool_recycle=3600)
conn = engine.connect()

### Creating a Table

```sql
SHOW TABLES;
```

In [9]:
def show_tables():
    print(engine.table_names())
    
show_tables()

[]

```sql
CREATE TABLE pet (
    name VARCHAR(20), 
    owner VARCHAR(20),
    species VARCHAR(20), 
    sex CHAR(1), 
    birth DATE, 
    death DATE
);
```

In [10]:
meta = MetaData()

pet = Table('pet', meta,
            Column('name', VARCHAR(20)),
            Column('owner', VARCHAR(20)),
            Column('species', VARCHAR(20)),
            Column('sex', CHAR(1)),
            Column('birth', DATE),
            Column('death', DATE)
           )
       
pet.create(engine)
show_tables()

['pet']

```sql
DESCRIBE pet;
```

In [11]:
print(meta.tables)

immutabledict({'pet': Table('pet', MetaData(bind=None), Column('name', VARCHAR(length=20), table=<pet>), Column('owner', VARCHAR(length=20), table=<pet>), Column('species', VARCHAR(length=20), table=<pet>), Column('sex', CHAR(length=1), table=<pet>), Column('birth', DATE(), table=<pet>), Column('death', DATE(), table=<pet>), schema=None)})

## Loading Data into a Table

```sql
INSERT INTO pet VALUES ('Fluffy',   'Harold',   'cat',      'f',    '1993-02-04',   NULL);
INSERT INTO pet VALUES ('Claws',    'Diane',    'cat',      'm',    '1994-03-17',   NULL);
INSERT INTO pet VALUES ('Buffy',    'Harold',   'dog',      'f',    '1989-05-13',   NULL);
INSERT INTO pet VALUES ('Fang',     'Benny',    'dog',      'm',    '1990-08-27',   NULL);
INSERT INTO pet VALUES ('Bowser',   'Diane',    'dog',      'm',    '1979-08-31',   '1995-07-29');
INSERT INTO pet VALUES ('Chirpy',   'Gwen',     'bird',     'f',    '1998-09-11',   NULL);
INSERT INTO pet VALUES ('Whistler', 'Gwen',     'bird',     NULL,   '1997-12-09',   NULL);
INSERT INTO pet VALUES ('Slim',     'Benny',    'snake',    'm',    '1996-04-29',   NULL);
INSERT INTO pet VALUES ('Puffball', 'Diane',    'hamster',  'f',    '1999-03-30',   NULL);
```

In [12]:
cols = [str(col).split('.')[1] for col in pet.columns]

ins_data = [
    ['Fluffy',	    'Harold',   'cat',	    'f',	'1993-02-04',	None],
    ['Claws',	    'Gwen',	    'cat',	    'm',	'1994-03-17',	None],
    ['Buffy',	    'Harold',	'dog',	    'f',	'1989-05-13',	None],
    ['Fang',	    'Benny',	'dog',	    'm',	'1990-08-27',	None],
    ['Bowser',	    'Diane',	'dog',	    'm',	'1979-08-31',	'1995-07-29'],
    ['Chirpy',	    'Gwen',	    'bird',	    'f',	'1998-09-11',	None],
    ['Whistler',    'Gwen',     'bird',	    None,	'1997-12-09',	None],
    ['Slim',	    'Benny',	'snake',	'm',	'1996-04-29',	None],
    ['Puffball',    'Diane',	'hamster',	'f',	'1999-03-30',	None]
]

data = [{col: d for col, d in zip(cols, ds)} for ds in ins_data]
result = conn.execute(pet.insert(), data)

### Selecting All Data

```sql
SELECT * FROM pet;
```

In [13]:
s = select([pet])
query(s)

('Fluffy', 'Harold', 'cat', 'f', datetime.date(1993, 2, 4), None)
('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)
('Fang', 'Benny', 'dog', 'm', datetime.date(1990, 8, 27), None)
('Bowser', 'Diane', 'dog', 'm', datetime.date(1979, 8, 31), datetime.date(1995, 7, 29))
('Chirpy', 'Gwen', 'bird', 'f', datetime.date(1998, 9, 11), None)
('Whistler', 'Gwen', 'bird', None, datetime.date(1997, 12, 9), None)
('Slim', 'Benny', 'snake', 'm', datetime.date(1996, 4, 29), None)
('Puffball', 'Diane', 'hamster', 'f', datetime.date(1999, 3, 30), None)

```sql
UPDATE pet SET birth = '1989-08-31' WHERE name = 'Bowser';
```

In [14]:
stmt = pet.update().\
            where(pet.c.name == 'Bowser').\
            values(birth = '1989-08-31')
result = conn.execute(stmt)

### Selecting Particular Rows

```sql
SELECT * FROM pet WHERE name = 'Bowser';
```

In [15]:
s = select([pet]).where(pet.c.name == 'Bowser')
query(s)

('Bowser', 'Diane', 'dog', 'm', datetime.date(1989, 8, 31), datetime.date(1995, 7, 29))

```sql
SELECT * FROM pet WHERE birth >= '1998-1-1';
```

In [16]:
s = select([pet]).where(pet.c.birth >= '1998-1-1')
query(s)

('Chirpy', 'Gwen', 'bird', 'f', datetime.date(1998, 9, 11), None)
('Puffball', 'Diane', 'hamster', 'f', datetime.date(1999, 3, 30), None)

```sql
SELECT * FROM pet WHERE species = 'dog' AND sex = 'f';
```

In [17]:
s = select([pet]).\
    where(
        and_(
            pet.c.species == 'dog', pet.c.sex == 'f'
            )
        )
query(s)

('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

```sql
SELECT * 
FROM pet 
WHERE species = 'snake' OR species = 'bird';
```

In [18]:
s = select([pet]).\
    where(
        or_(
            pet.c.species == 'snake', pet.c.species == 'bird'
            )
        )
query(s)

('Chirpy', 'Gwen', 'bird', 'f', datetime.date(1998, 9, 11), None)
('Whistler', 'Gwen', 'bird', None, datetime.date(1997, 12, 9), None)
('Slim', 'Benny', 'snake', 'm', datetime.date(1996, 4, 29), None)

```sql
SELECT * 
FROM pet 
WHERE (species = 'cat' AND sex = 'm') OR (species = 'dog' AND sex = 'f');
```

In [19]:
s = select([pet]).\
    where(
        or_(
            and_(
                pet.c.species == 'cat', pet.c.sex == 'm'
            ),
            and_(
                pet.c.species == 'dog', pet.c.sex == 'f'
            )
            )
        )
query(s)

('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

### Selecting Particular Columns

```sql
SELECT name, birth 
FROM pet;
```

In [20]:
s = select([pet.c.name, pet.c.birth])
query(s)

('Fluffy', datetime.date(1993, 2, 4))
('Claws', datetime.date(1994, 3, 17))
('Buffy', datetime.date(1989, 5, 13))
('Fang', datetime.date(1990, 8, 27))
('Bowser', datetime.date(1989, 8, 31))
('Chirpy', datetime.date(1998, 9, 11))
('Whistler', datetime.date(1997, 12, 9))
('Slim', datetime.date(1996, 4, 29))
('Puffball', datetime.date(1999, 3, 30))

```sql
SELECT owner 
FROM pet;
```

In [21]:
s = select([pet.c.owner])
query(s)

('Harold',)
('Gwen',)
('Harold',)
('Benny',)
('Diane',)
('Gwen',)
('Gwen',)
('Benny',)
('Diane',)

```sql
SELECT DISTINCT owner 
FROM pet;
```

In [22]:
s = select([pet.c.owner]).distinct()
query(s)

('Harold',)
('Gwen',)
('Benny',)
('Diane',)

```sql
SELECT name, species, birth 
FROM pet 
WHERE species = 'dog' OR species = 'cat';
```

In [23]:
s = select([pet.c.name, pet.c.species, pet.c.birth]).\
        where(
            or_(pet.c.species == 'dog', pet.c.species == 'cat')
            )  
query(s)

('Fluffy', 'cat', datetime.date(1993, 2, 4))
('Claws', 'cat', datetime.date(1994, 3, 17))
('Buffy', 'dog', datetime.date(1989, 5, 13))
('Fang', 'dog', datetime.date(1990, 8, 27))
('Bowser', 'dog', datetime.date(1989, 8, 31))

### Sorting Rows

```sql
SELECT name, birth 
FROM pet 
ORDER BY birth;
```

In [24]:
s = select([pet.c.name, pet.c.birth]).order_by('birth')     
query(s)

('Buffy', datetime.date(1989, 5, 13))
('Bowser', datetime.date(1989, 8, 31))
('Fang', datetime.date(1990, 8, 27))
('Fluffy', datetime.date(1993, 2, 4))
('Claws', datetime.date(1994, 3, 17))
('Slim', datetime.date(1996, 4, 29))
('Whistler', datetime.date(1997, 12, 9))
('Chirpy', datetime.date(1998, 9, 11))
('Puffball', datetime.date(1999, 3, 30))

```sql
SELECT name, birth 
FROM pet 
ORDER BY birth DESC;
```

In [25]:
s = select([pet.c.name, pet.c.birth]).order_by(desc('birth'))     
query(s)

('Puffball', datetime.date(1999, 3, 30))
('Chirpy', datetime.date(1998, 9, 11))
('Whistler', datetime.date(1997, 12, 9))
('Slim', datetime.date(1996, 4, 29))
('Claws', datetime.date(1994, 3, 17))
('Fluffy', datetime.date(1993, 2, 4))
('Fang', datetime.date(1990, 8, 27))
('Bowser', datetime.date(1989, 8, 31))
('Buffy', datetime.date(1989, 5, 13))

```sql
SELECT name, species, birth 
FROM pet 
ORDER BY species, birth DESC;
```

In [26]:
s = select([pet.c.name, pet.c.species, pet.c.birth]).order_by('species', desc('birth'))     
query(s)

('Chirpy', 'bird', datetime.date(1998, 9, 11))
('Whistler', 'bird', datetime.date(1997, 12, 9))
('Claws', 'cat', datetime.date(1994, 3, 17))
('Fluffy', 'cat', datetime.date(1993, 2, 4))
('Fang', 'dog', datetime.date(1990, 8, 27))
('Bowser', 'dog', datetime.date(1989, 8, 31))
('Buffy', 'dog', datetime.date(1989, 5, 13))
('Puffball', 'hamster', datetime.date(1999, 3, 30))
('Slim', 'snake', datetime.date(1996, 4, 29))

### Date Calculations

```sql
SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR,birth,CURDATE()) AS age 
FROM pet;
```

In [27]:
s = select([pet.c.name, pet.c.birth, func.curdate(), func.timestampdiff(text('YEAR'), pet.c.birth, func.curdate())])   
query(s)

('Fluffy', datetime.date(1993, 2, 4), datetime.date(2019, 9, 18), 26)
('Claws', datetime.date(1994, 3, 17), datetime.date(2019, 9, 18), 25)
('Buffy', datetime.date(1989, 5, 13), datetime.date(2019, 9, 18), 30)
('Fang', datetime.date(1990, 8, 27), datetime.date(2019, 9, 18), 29)
('Bowser', datetime.date(1989, 8, 31), datetime.date(2019, 9, 18), 30)
('Chirpy', datetime.date(1998, 9, 11), datetime.date(2019, 9, 18), 21)
('Whistler', datetime.date(1997, 12, 9), datetime.date(2019, 9, 18), 21)
('Slim', datetime.date(1996, 4, 29), datetime.date(2019, 9, 18), 23)
('Puffball', datetime.date(1999, 3, 30), datetime.date(2019, 9, 18), 20)

```sql
SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR,birth,CURDATE()) AS age 
FROM pet
ORDER BY name;
```

In [28]:
s = select([pet.c.name, pet.c.birth, func.curdate(), func.timestampdiff(text('YEAR'), pet.c.birth, func.curdate()).label('age')]).order_by('name')   
query(s)

('Bowser', datetime.date(1989, 8, 31), datetime.date(2019, 9, 18), 30)
('Buffy', datetime.date(1989, 5, 13), datetime.date(2019, 9, 18), 30)
('Chirpy', datetime.date(1998, 9, 11), datetime.date(2019, 9, 18), 21)
('Claws', datetime.date(1994, 3, 17), datetime.date(2019, 9, 18), 25)
('Fang', datetime.date(1990, 8, 27), datetime.date(2019, 9, 18), 29)
('Fluffy', datetime.date(1993, 2, 4), datetime.date(2019, 9, 18), 26)
('Puffball', datetime.date(1999, 3, 30), datetime.date(2019, 9, 18), 20)
('Slim', datetime.date(1996, 4, 29), datetime.date(2019, 9, 18), 23)
('Whistler', datetime.date(1997, 12, 9), datetime.date(2019, 9, 18), 21)

```sql
SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR,birth,CURDATE()) AS age 
FROM pet
ORDER BY age;
```

In [29]:

s = select([pet.c.name, pet.c.birth, func.curdate(), func.timestampdiff(text('YEAR'), pet.c.birth, func.curdate()).label('age')]).order_by('age')
query(s)

('Puffball', datetime.date(1999, 3, 30), datetime.date(2019, 9, 18), 20)
('Chirpy', datetime.date(1998, 9, 11), datetime.date(2019, 9, 18), 21)
('Whistler', datetime.date(1997, 12, 9), datetime.date(2019, 9, 18), 21)
('Slim', datetime.date(1996, 4, 29), datetime.date(2019, 9, 18), 23)
('Claws', datetime.date(1994, 3, 17), datetime.date(2019, 9, 18), 25)
('Fluffy', datetime.date(1993, 2, 4), datetime.date(2019, 9, 18), 26)
('Fang', datetime.date(1990, 8, 27), datetime.date(2019, 9, 18), 29)
('Buffy', datetime.date(1989, 5, 13), datetime.date(2019, 9, 18), 30)
('Bowser', datetime.date(1989, 8, 31), datetime.date(2019, 9, 18), 30)

```sql
SELECT name, birth, death, TIMESTAMPDIFF(YEAR,birth,death) AS age 
FROM pet
WHERE death IS NOT NULL
ORDER BY age;
```

In [30]:
s = select([pet.c.name, pet.c.birth, pet.c.death, func.timestampdiff(text('YEAR'), pet.c.birth, pet.c.death).label('age')]).\
    where(pet.c.death != None).order_by('age')
query(s)

('Bowser', datetime.date(1989, 8, 31), datetime.date(1995, 7, 29), 5)

```sql
SELECT name, birth, MONTH(birth) 
FROM pet;
```

In [31]:
s = select([pet.c.name, pet.c.birth, func.month(pet.c.birth)])
query(s)

('Fluffy', datetime.date(1993, 2, 4), 2)
('Claws', datetime.date(1994, 3, 17), 3)
('Buffy', datetime.date(1989, 5, 13), 5)
('Fang', datetime.date(1990, 8, 27), 8)
('Bowser', datetime.date(1989, 8, 31), 8)
('Chirpy', datetime.date(1998, 9, 11), 9)
('Whistler', datetime.date(1997, 12, 9), 12)
('Slim', datetime.date(1996, 4, 29), 4)
('Puffball', datetime.date(1999, 3, 30), 3)

```sql
SELECT name, birth 
FROM pet 
WHERE MONTH(birth) = 5;
```

In [32]:
s = select([pet.c.name, pet.c.birth]).\
        where(func.month(pet.c.birth) == 5)
query(s)

('Buffy', datetime.date(1989, 5, 13))

### Pattern Matching

To find names beginning with b:

```sql
SELECT * 
FROM pet 
WHERE name LIKE 'b%';
```

In [33]:
s = select([pet]).\
        where(pet.c.name.like('b%'))
query(s)

('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)
('Bowser', 'Diane', 'dog', 'm', datetime.date(1989, 8, 31), datetime.date(1995, 7, 29))

To find names ending with fy:

```sql
SELECT * 
FROM pet 
WHERE name LIKE '%fy';
```

In [34]:
s = select([pet]).\
        where(pet.c.name.like('%fy'))
query(s)

('Fluffy', 'Harold', 'cat', 'f', datetime.date(1993, 2, 4), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

To find names containing a w

```sql
SELECT * 
FROM pet 
WHERE name LIKE '%w%';
```

In [35]:
s = select([pet]).\
        where(pet.c.name.like('%w%'))
query(s)

('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Bowser', 'Diane', 'dog', 'm', datetime.date(1989, 8, 31), datetime.date(1995, 7, 29))
('Whistler', 'Gwen', 'bird', None, datetime.date(1997, 12, 9), None)

To find names containing exactly five characters, use five instances of the _ pattern character:

```sql
SELECT * 
FROM pet 
WHERE name LIKE '%w%';
```

In [36]:
s = select([pet]).\
        where(pet.c.name.like('_____'))
query(s)

('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

To find names beginning with b, use ^ to match the beginning of the name:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, '^b');
```

In [37]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, '^b'))
query(s)

('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)
('Bowser', 'Diane', 'dog', 'm', datetime.date(1989, 8, 31), datetime.date(1995, 7, 29))

To find names ending with `fy`, use `$` to match the end of the name:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, 'fy%');
```

In [38]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, 'fy$'))
query(s)

('Fluffy', 'Harold', 'cat', 'f', datetime.date(1993, 2, 4), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

To find names containing a `w`, use this query:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, 'w');
```

In [39]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, 'w'))
query(s)

('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Bowser', 'Diane', 'dog', 'm', datetime.date(1989, 8, 31), datetime.date(1995, 7, 29))
('Whistler', 'Gwen', 'bird', None, datetime.date(1997, 12, 9), None)

To find names containing exactly five characters, use `^` and `$` to match the beginning and end of the name, and five instances of . in between:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, '^.....$');
```

In [40]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, '^.....$'))
query(s)

('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

You could also write the previous query using the {**n**} (“*repeat-**n**-times*”) operator:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, '^.....$');
```

In [41]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, '^.{5}$'))
query(s)

('Claws', 'Gwen', 'cat', 'm', datetime.date(1994, 3, 17), None)
('Buffy', 'Harold', 'dog', 'f', datetime.date(1989, 5, 13), None)

### Counting Rows

```sql
SELECT COUNT(*) FROM pet;
```

In [42]:
s = select([func.count()]).select_from(pet)
query(s)

(9,)

```sql
SELECT owner, COUNT(*) 
FROM pet 
GROUP BY owner;
```

In [43]:
s = select([pet.c.owner, func.count()]).group_by('owner')
query(s)

('Harold', 2)
('Gwen', 3)
('Benny', 2)
('Diane', 2)

Number of animals per species:

```sql
SELECT species, COUNT(*) 
FROM pet 
GROUP BY species;
```

In [44]:
s = select([pet.c.species, func.count()]).group_by('species')
query(s)

('cat', 2)
('dog', 3)
('bird', 2)
('snake', 1)
('hamster', 1)

Number of animals per sex:

```sql
SELECT sex, COUNT(*) 
FROM pet 
GROUP BY sex;
```

In [45]:
s = select([pet.c.sex, func.count()]).group_by('sex')
query(s)

('f', 4)
('m', 4)
(None, 1)

Number of animals per combination of species and sex:

```sql
SELECT species, sex, COUNT(*) 
FROM pet 
GROUP BY species, sex;
```

In [46]:
s = select([pet.c.species, pet.c.sex, func.count()]).group_by('species', 'sex')
query(s)

('cat', 'f', 1)
('cat', 'm', 1)
('dog', 'f', 1)
('dog', 'm', 2)
('bird', 'f', 1)
('bird', None, 1)
('snake', 'm', 1)
('hamster', 'f', 1)

```sql
SELECT species, sex, COUNT(*) FROM pet
WHERE species = 'dog' OR species = 'cat'
GROUP BY species, sex;
```

In [47]:
s = select([pet.c.species, pet.c.sex, func.count()]).\
        where(or_(pet.c.species == 'dog', pet.c.species == 'cat')).\
        group_by('species', 'sex')
query(s)

('cat', 'f', 1)
('cat', 'm', 1)
('dog', 'f', 1)
('dog', 'm', 2)

```sql
SELECT species, sex, COUNT(*) FROM pet
WHERE sex IS NOT NULL
GROUP BY species, sex;
```

In [48]:
s = select([pet.c.species, pet.c.sex, func.count()]).\
        where(pet.c.sex != None).\
        group_by('species', 'sex')
query(s)

('cat', 'f', 1)
('cat', 'm', 1)
('dog', 'f', 1)
('dog', 'm', 2)
('bird', 'f', 1)
('snake', 'm', 1)
('hamster', 'f', 1)

### Using More Than one Table

```sql
CREATE TABLE event (
    name VARCHAR(20), 
    date DATE,
    type VARCHAR(15), 
    remark VARCHAR(255)
);
```

In [49]:
meta = MetaData()

event = Table('event', meta,
            Column('name', VARCHAR(20)),
            Column('date', DATE),
            Column('type', VARCHAR(15)),
            Column('remark', VARCHAR(255))
           )
       
event.create(engine)
show_tables()

['event', 'pet']

```sql
INSERT INTO event VALUES ('Fluffy',	    '1995-05-15',   'litter',	'4 kittens, 3 female, 1 male');
INSERT INTO event VALUES ('Buffy',	    '1993-06-23',	'litter',	'5 puppies, 2 female, 3 male');
INSERT INTO event VALUES ('Buffy',	    '1994-06-19',	'litter',	'3 puppies, 3 female');
INSERT INTO event VALUES ('Chirpy',	    '1999-03-21',	'vet',      'needed beak straightened');
INSERT INTO event VALUES ('Slim',	    '1997-08-03',	'vet',	    'broken rib');
INSERT INTO event VALUES ('Bowser',	    '1991-10-12',	'kennel',   NULL);
INSERT INTO event VALUES ('Fang',	    '1991-10-12',	'kennel',   NULL);
INSERT INTO event VALUES ('Fang',	    '1998-08-28',	'birthday',	'Gave him a new chew toy');
INSERT INTO event VALUES ('Claws',	    '1998-03-17',	'birthday',	'Gave him a new flea collar');
INSERT INTO event VALUES ('Whistler',   '1998-12-09',	'birthday',	'First birthday');
```

In [50]:
cols = [str(col).split('.')[1] for col in event.columns]

ins_data = [
    ['Fluffy',	    '1995-05-15',   'litter',   '4 kittens, 3 female, 1 male'],
    ['Buffy',	    '1993-06-23',	'litter',   '5 puppies, 2 female, 3 male'],
    ['Buffy',	    '1994-06-19',	'litter',   '3 puppies, 3 female'],
    ['Chirpy',	    '1999-03-21',	'vet',      'needed beak straightened'],
    ['Slim',	    '1997-08-03',	'vet',	    'broken rib'],
    ['Bowser',	    '1991-10-12',	'kennel',   None],
    ['Fang',	    '1991-10-12',	'kennel',   None],
    ['Fang',	    '1998-08-28',	'birthday', 'Gave him a new chew toy'],
    ['Claws',	    '1998-03-17',	'birthday', 'Gave him a new flea collar'],
    ['Whistler',    '1998-12-09',	'birthday', 'First birthday']
]

data = [{col: d for col, d in zip(cols, ds)} for ds in ins_data]
result = conn.execute(event.insert(), data)

In [51]:
s = select([event])
query(s)

('Fluffy', datetime.date(1995, 5, 15), 'litter', '4 kittens, 3 female, 1 male')
('Buffy', datetime.date(1993, 6, 23), 'litter', '5 puppies, 2 female, 3 male')
('Buffy', datetime.date(1994, 6, 19), 'litter', '3 puppies, 3 female')
('Chirpy', datetime.date(1999, 3, 21), 'vet', 'needed beak straightened')
('Slim', datetime.date(1997, 8, 3), 'vet', 'broken rib')
('Bowser', datetime.date(1991, 10, 12), 'kennel', None)
('Fang', datetime.date(1991, 10, 12), 'kennel', None)
('Fang', datetime.date(1998, 8, 28), 'birthday', 'Gave him a new chew toy')
('Claws', datetime.date(1998, 3, 17), 'birthday', 'Gave him a new flea collar')
('Whistler', datetime.date(1998, 12, 9), 'birthday', 'First birthday')

```sql
SELECT pet.name, TIMESTAMPDIFF(YEAR,birth,date) AS age, remark
FROM pet INNER JOIN event ON pet.name = event.name
WHERE event.type = 'litter';
```

In [52]:
s = select([pet.c.name, func.timestampdiff(text('YEAR'), pet.c.birth, text('date')).label('age'), event.c.remark]).\
        select_from(pet.join(event, pet.c.name == event.c.name)).\
        where(event.c.type == 'litter')
query(s)

('Fluffy', 2, '4 kittens, 3 female, 1 male')
('Buffy', 4, '5 puppies, 2 female, 3 male')
('Buffy', 5, '3 puppies, 3 female')

```sql
SELECT p1.name, p1.sex, p2.name, p2.sex, p1.species
FROM pet AS p1 INNER JOIN pet AS p2
ON p1.species = p2.species
AND p1.sex = 'f' AND p1.death IS NULL
AND p2.sex = 'm' AND p2.death IS NULL;
```

In [53]:
p1 = pet.alias('p1')
p2 = pet.alias('p2')
s = select([p1.c.name, p1.c.sex, p2.c.name, p2.c.sex, p1.c.species]).\
        select_from(p1.join(p2, and_(
            p1.c.species == p2.c.species, and_(
                p1.c.sex == 'f', and_(
                    p1.c.death == None, and_(
                        p2.c.sex == 'm', p2.c.death == None))))))
query(s)

('Fluffy', 'f', 'Claws', 'm', 'cat')
('Buffy', 'f', 'Fang', 'm', 'dog')